apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_serial.c
#ifdef CONFIG_ESP32S3_UART

/* Operations */

static struct uart_ops_s g_uart_ops =
{
  .setup         = esp32s3_setup,
  .shutdown      = esp32s3_shutdown,
  .attach        = esp32s3_attach,
  .detach        = esp32s3_detach,
  .ioctl         = esp32s3_ioctl,
  .receive       = esp32s3_receive,
  .rxint         = esp32s3_rxint,
  .rxavailable   = esp32s3_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol = esp32s3_rxflowcontrol,
#endif
  .send          = esp32s3_send,
  .txint         = esp32s3_txint,
  .txready       = esp32s3_txready,
  .txempty       = esp32s3_txempty
};

/* UART 0 */

#ifdef CONFIG_ESP32S3_UART0

static char g_uart0_rxbuffer[CONFIG_UART0_RXBUFSIZE];
static char g_uart0_txbuffer[CONFIG_UART0_TXBUFSIZE];

/* Fill only the requested fields */

static uart_dev_t g_uart0_dev =
{
#ifdef CONFIG_UART0_SERIAL_CONSOLE
  .isconsole = true,
#else
  .isconsole = false,
#endif
  .xmit =
  {
    .size   = CONFIG_UART0_TXBUFSIZE,
    .buffer = g_uart0_txbuffer,
  },
  .recv =
  {
    .size   = CONFIG_UART0_RXBUFSIZE,
    .buffer = g_uart0_rxbuffer,
  },

  .ops  = &g_uart_ops,
  .priv = &g_uart0_config
};

#endif

/* UART 1 */

#ifdef CONFIG_ESP32S3_UART1

static char g_uart1_rxbuffer[CONFIG_UART1_RXBUFSIZE];
static char g_uart1_txbuffer[CONFIG_UART1_TXBUFSIZE];

/* Fill only the requested fields */

static uart_dev_t g_uart1_dev =
{
#ifdef CONFIG_UART1_SERIAL_CONSOLE
  .isconsole = true,
#else
  .isconsole = false,
#endif
  .xmit =
  {
    .size   = CONFIG_UART1_TXBUFSIZE,
    .buffer = g_uart1_txbuffer,
  },
  .recv =
  {
    .size   = CONFIG_UART1_RXBUFSIZE,
    .buffer = g_uart1_rxbuffer,
  },

  .ops  = &g_uart_ops,
  .priv = &g_uart1_config
};

#endif

/* UART 2 */

#ifdef CONFIG_ESP32S3_UART2

static char g_uart2_rxbuffer[CONFIG_UART2_RXBUFSIZE];
static char g_uart2_txbuffer[CONFIG_UART2_TXBUFSIZE];

/* Fill only the requested fields */

static uart_dev_t g_uart2_dev =
{
#ifdef CONFIG_UART2_SERIAL_CONSOLE
  .isconsole = true,
#else
  .isconsole = false,
#endif
  .xmit =
  {
    .size   = CONFIG_UART2_TXBUFSIZE,
    .buffer = g_uart2_txbuffer,
  },
  .recv =
  {
    .size   = CONFIG_UART2_RXBUFSIZE,
    .buffer = g_uart2_rxbuffer,
  },

  .ops  = &g_uart_ops,
  .priv = &g_uart2_config
};

#endif

#endif /* CONFIG_ESP32S3_UART */

/****************************************************************************
 * Private Functions
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_UART

/****************************************************************************
 * Name: uart_handler
 *
 * Description:
 *   This is the UART interrupt handler.  It will be invoked when an
 *   interrupt is received on the 'irq'.  It should call uart_xmitchars or
 *   uart_recvchars to perform the appropriate data transfers.  The
 *   interrupt handling logic must be able to map the 'irq' number into the
 *   appropriate uart_dev_s structure in order to call these functions.
 *
 ****************************************************************************/

static int uart_handler(int irq, void *context, void *arg)
{
  struct uart_dev_s *dev = (struct uart_dev_s *)arg;
  struct esp32s3_uart_s *priv = dev->priv;
  uint32_t tx_mask = UART_TXFIFO_EMPTY_INT_ST_M | UART_TX_DONE_INT_ST_M;
  uint32_t rx_mask = UART_RXFIFO_TOUT_INT_ST_M | UART_RXFIFO_FULL_INT_ST_M;
  uint32_t rx_ovf_mask = UART_RXFIFO_OVF_INT_ST_M;
  uint32_t int_status;

  int_status = getreg32(UART_INT_ST_REG(priv->id));

#ifdef HAVE_RS485
  if ((int_status & UART_TX_BRK_IDLE_DONE_INT_ST_M) != 0 &&
      esp32s3_txempty(dev))
    {
      if (dev->xmit.tail == dev->xmit.head)
        {
          esp_gpiowrite(priv->rs485_dir_gpio, !priv->rs485_dir_polarity);
        }
    }
#endif

  /* Tx fifo empty interrupt or UART tx done int */

  if ((int_status & tx_mask) != 0)
    {
      uart_xmitchars(dev);
      modifyreg32(UART_INT_CLR_REG(priv->id), tx_mask, tx_mask);
    }

  /* Rx fifo timeout interrupt or rx fifo full interrupt */

  if ((int_status & rx_mask) != 0)
    {
      uart_recvchars(dev);
      modifyreg32(UART_INT_CLR_REG(priv->id), rx_mask, rx_mask);
    }

  if ((int_status & rx_ovf_mask) != 0)
    {
      esp32s3_lowputc_rst_rxfifo(priv);
      modifyreg32(UART_INT_CLR_REG(priv->id), rx_ovf_mask, rx_ovf_mask);
    }

  return OK;
}

/****************************************************************************
 * Name: esp32s3_setup
 *
 * Description:
 *      Configure the UART baud, bits, parity, fifos, etc. This method is
 *      called the first time that the serial port is opened.
 *      For the serial console, this will occur very early in initialization,
 *      for other serial ports this will occur when the port is first opened.
 *      This setup does not include attaching or enabling interrupts.
 *      That portion of the UART setup is performed when the attach() method
 *      is called.
 *
 * Parameters:
 *   dev        -  Pointer to the serial driver struct.
 *
 * Returned Values:
 *   Zero (OK) is returned.
 *
 ****************************************************************************/

static int esp32s3_setup(struct uart_dev_s *dev)
{
  struct esp32s3_uart_s *priv = dev->priv;

  /* Initialize UART module */

  /* Discard corrupt RX data and
   * disable UART memory clock gate enable signal.
   */

  modifyreg32(UART_CONF0_REG(priv->id), UART_ERR_WR_MASK_M |
              UART_MEM_CLK_EN_M, UART_ERR_WR_MASK_M);

  /* Define 0 as the threshold that means TX FIFO buffer is empty. */

  modifyreg32(UART_CONF1_REG(priv->id), UART_TXFIFO_EMPTY_THRHD_M, 0);

  /* Define a threshold to trigger an RX FIFO FULL interrupt.
   */

  modifyreg32(UART_CONF1_REG(priv->id), UART_RXFIFO_FULL_THRHD_M,
              CONFIG_ESP32S3_RX_FIFO_THRD << UART_RXFIFO_FULL_THRHD_S);

  /* Define a rx fifo timeout to trigger RX TOUT interrupt.
   */

  modifyreg32(UART_CONF1_REG(priv->id),
            UART_RX_TOUT_THRHD_M | UART_RX_TOUT_EN_M,
            (CONFIG_ESP32S3_RX_FIFO_TOUT << UART_RX_TOUT_THRHD_S) |
            UART_RX_TOUT_EN_M);

  /* Define the maximum FIFO size for RX and TX FIFO.
   * That means, 1 block = 128 bytes.
   * As a consequence, software serial FIFO can unload the bytes and
   * not wait too much on polling activity.
   */

  modifyreg32(UART_MEM_CONF_REG(priv->id), UART_TX_SIZE_M | UART_RX_SIZE_M,
              (1 << UART_TX_SIZE_S) | (1 << UART_RX_SIZE_S));

  /* Configure the UART Baud Rate */

