apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_serial.c
      case TCGETS:
        {
          struct termios  *termiosp   = (struct termios *)arg;
          struct esp32s3_uart_s *priv = (struct esp32s3_uart_s *)dev->priv;

          if (termiosp == NULL)
            {
              ret = -EINVAL;
              break;
            }

          /* Return parity (0 = no, 1 = odd, 2 = even). */

          termiosp->c_cflag = (priv->parity != 0 ? PARENB : 0) |
                              (priv->parity == 1 ? PARODD : 0);

          /* Return stop bits */

          termiosp->c_cflag |= priv->stop_b2 != 0 ? CSTOPB : 0;

#ifdef CONFIG_SERIAL_OFLOWCONTROL
          termiosp->c_cflag |=  priv->oflow != 0 ? CCTS_OFLOW : 0;
#endif
#ifdef CONFIG_SERIAL_IFLOWCONTROL
          termiosp->c_cflag |=  priv->iflow != 0 ? CRTS_IFLOW : 0;
#endif

          /* Set the baud rate in the termiosp using the
           * cfsetispeed interface.
           */

          cfsetispeed(termiosp, priv->baud);

          /* Return number of bits. */

          switch (priv->bits)
            {
              case 5:
                termiosp->c_cflag |= CS5;
                break;

              case 6:
                termiosp->c_cflag |= CS6;
                break;

              case 7:
                termiosp->c_cflag |= CS7;
                break;

              default:
              case 8:
                termiosp->c_cflag |= CS8;
                break;
            }
        }
        break;

      case TCSETS:
        {
          struct termios  *termiosp   = (struct termios *)arg;
          struct esp32s3_uart_s *priv = (struct esp32s3_uart_s *)dev->priv;
          uint32_t baud;
          uint32_t current_int_sts;
          uint8_t  parity;
          uint8_t  bits;
          uint8_t  stop2;
#ifdef CONFIG_SERIAL_IFLOWCONTROL
          bool iflow;
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
          bool oflow;
#endif

          if (termiosp == NULL)
            {
              ret = -EINVAL;
              break;
            }

          /* Get the target baud rate to change. */

          baud = cfgetispeed(termiosp);

          /* Decode number of bits. */

          switch (termiosp->c_cflag & CSIZE)
            {
              case CS5:
                bits = 5;
                break;

              case CS6:
                bits = 6;
                break;

              case CS7:
                bits = 7;
                break;

              case CS8:
                bits = 8;
                break;

              default:
                ret = -EINVAL;
                break;
            }

          /* Decode parity. */

          if ((termiosp->c_cflag & PARENB) != 0)
            {
              parity = (termiosp->c_cflag & PARODD) != 0 ? 1 : 2;
            }
          else
            {
              parity = 0;
            }

          /* Decode stop bits. */

          stop2 = (termiosp->c_cflag & CSTOPB) != 0 ? 1 : 0;

#ifdef CONFIG_SERIAL_IFLOWCONTROL
          iflow = (termiosp->c_cflag & CRTS_IFLOW) != 0;
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
          oflow = (termiosp->c_cflag & CCTS_OFLOW) != 0;
#endif

          /* Verify that all settings are valid before
           * performing the changes.
           */

          if (ret == OK)
            {
              /* Fill the private struct fields. */

              priv->baud      = baud;
              priv->parity    = parity;
              priv->bits      = bits;
              priv->stop_b2   = stop2;
#ifdef CONFIG_SERIAL_IFLOWCONTROL
              priv->iflow     = iflow;
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
              priv->oflow     = oflow;
#endif

              /* Effect the changes immediately - note that we do not
               * implement TCSADRAIN or TCSAFLUSH, only TCSANOW option.
               * See nuttx/libs/libc/termios/lib_tcsetattr.c
               */

              esp32s3_lowputc_disable_all_uart_int(priv, &current_int_sts);
              ret = esp32s3_setup(dev);

              /* Restore the interrupt state */

              esp32s3_lowputc_restore_all_uart_int(priv, &current_int_sts);
            }
        }
        break;
#endif /* CONFIG_SERIAL_TERMIOS */

      default:
        ret = -ENOTTY;
        break;
    }

  return ret;
}

/****************************************************************************
 * Name: esp32s3_rxflowcontrol
 *
 * Description:
 *   Called when upper half RX buffer is full (or exceeds configured
 *   watermark levels if CONFIG_SERIAL_IFLOWCONTROL_WATERMARKS is defined).
 *   Return true if UART activated RX flow control to block more incoming
 *   data.
 *   NOTE: ESP32-S3 has a hardware RX FIFO threshold mechanism to control
 *   RTS line and to stop receiving data. This is very similar to the concept
 *   behind upper watermark level. The hardware threshold is used here
 *   to control the RTS line. When setting the threshold to zero, RTS will
 *   immediately be asserted. If nbuffered = 0 or the lower watermark is
 *   crossed and the serial driver decides to disable RX flow control, the
 *   threshold will be changed to UART_RX_FLOW_THRHD_VALUE, which is almost
 *   half the HW RX FIFO capacity. It keeps some space to keep the data
 *   received between the RTS assertion and the stop by the sender.
 *
 * Input Parameters:
 *   dev       - UART device instance
 *   nbuffered - the number of characters currently buffered
 *               (if CONFIG_SERIAL_IFLOWCONTROL_WATERMARKS is
 *               not defined the value will be 0 for an empty buffer or the
 *               defined buffer size for a full buffer)
 *   upper     - true indicates the upper watermark was crossed where
 *               false indicates the lower watermark has been crossed
 *
 * Returned Value:
 *   true if RX flow control activated.
 *
 ****************************************************************************/

#ifdef CONFIG_SERIAL_IFLOWCONTROL
static bool esp32s3_rxflowcontrol(struct uart_dev_s *dev,
                                  unsigned int nbuffered, bool upper)
{
  bool ret = false;
  struct esp32s3_uart_s *priv = dev->priv;

  if (priv->iflow)
    {
      if (nbuffered == 0 || upper == false)
        {
          /* Empty buffer, RTS should be de-asserted and logic in above
           * layers should re-enable RX interrupt.
           */

          esp32s3_lowputc_set_iflow(priv, (uint8_t)(UART_RX_FIFO_SIZE / 2),
                                    true);
          esp32s3_rxint(dev, true);
          ret = false;
        }
      else
        {
          /* If the RX buffer is not zero and watermarks are not enabled,
           * then this function is called to announce RX buffer is full.
           * The first thing it should do is to immediately assert RTS.
           * Software RX FIFO is full, so besides asserting RTS, it's
           * necessary to disable RX interrupts to prevent remaining bytes
           * (that arrive after asserting RTS) to be pushed to the
           * SW RX FIFO.
           */

